import Vue from 'vue'
import Vuex from 'vuex'

Vue.use(Vuex)

let state = {
  city: '北京',
  cityArr: [
    ['北京', '上海', '天津', '重庆', '广州'],
    ['深圳', '河南', '辽宁', '吉林', '江苏'],
    ['江西', '四川', '海南', '贵州', '云南'],
    ['西藏', '陕西', '甘肃', '青海', '珠海']
  ],
  menu: [{
      title: '2017新品',
      tags: ['休闲鞋', '商务休闲鞋', '正装鞋', '帆布鞋', '凉鞋', '拖鞋', '功能鞋', '增高鞋', '工装鞋', '雨鞋']
    },
    {
      title: '运动鞋包',
      tags: ['跑步鞋', '休闲鞋', '篮球鞋', '帆布鞋', '板鞋', '拖鞋', '运动包']
    },
    {
      title: '健身训练',
      tags: ['跑步机', '健身车/动感单车', '椭圆机', '综合训练器', '划船机', '甩脂机', '倒立机', '武术搏击']
    },
    {
      title: '骑行运动',
      tags: ['山地车', '公路车', '折叠车', '骑行服', '电动车', '电动滑板车', '城市自行车', '平衡车']
    },
    {
      title: '体育用品',
      tags: ['乒乓球', '羽毛球', '篮球', '足球', '轮滑滑板', '网球', '高尔夫', '台球', '排球']
    },
    {
      title: '户外鞋服',
      tags: ['户外风衣', '徒步鞋', 'T恤', '冲锋衣裤', '速干衣裤', '越野跑鞋', '滑雪服', '羽绒服/棉服', '休闲衣裤']
    },
    {
      title: '户外装备',
      tags: ['背包', '帐篷/垫子', '望远镜', '烧烤用具', '便携桌椅床', '户外配饰', '军迷用品', '野餐用品']
    },
    {
      title: '垂钓用品',
      tags: ['钓竿', '鱼线', '浮漂', '鱼饵', '钓鱼配件', '渔具包', '钓箱钓椅', '鱼线轮', '钓鱼灯']
    },
    {
      title: '游泳用品',
      tags: ['女士泳衣', '比基尼', '男士泳衣', '泳镜', '游泳圈', '游泳包防水包', '泳帽', '游泳配件']
    }
  ]
}
export default new Vuex.Store({
  state
})
